// - Користувач вводить або має два числа.
//     Потрібно знайти та вивести максимальне число з тих двох .
//     Також потрібно врахувати коли введені рівні числа.
//
let Number1 = 85;
let Number2 = 20;
(Number1 > Number2) ? document.write(`Число ${Number1} більше від числа ${Number2}</br>`) : document.write(`Число ${Number2} більше від числа ${Number1}</br>`);
//
//
// - У першому під'їзді квартири з 1 до 20. У другому з 21 по 48. У третьому з 49 по 90.
// Користувач вводить номер квартири просто в змінні або через prompt('') .
//     Програма повинна зазначити, в якому під'їзді знаходиться дана квартира.
//

let NumberRoom = 91;

if (NumberRoom > 20 && NumberRoom < 49) {
    document.write(`Ця квартира в другому підїзді</br>`)
} else if (NumberRoom > 0 && NumberRoom < 21) {
    document.write(`Ця квартира в першому підїзді</br>`)

} else if (NumberRoom > 48 && NumberRoom < 90) {
    document.write(`Ця квартира в третьому підїзді</br>`)
} else document.write(`Цю квартиру ще не побудували</br>`)


//
// - Ми маємо змінну number в яку користувач задає числове значення,  якщо змінна рівна 10 вивести повідомлення ВІРНО, якщо змінна не рівна 10 - тоді НЕВІРНО
//
let number = 1;
(number === 10) ? document.write(`ВІРНО. Це 10</br>`) : document.write(`НЕВІРНО. Це не 10</br>`);

// - Ми маємо змінну x в яку користувач задає  значення,  якщо в змінну записане число, вивести 1,
//     якщо в змінну записали стрінгу вивести 2, якщо булеве значення - 3, якщо об'єкт або масив - 3.
// якщо в змінну записали щось інше, спрацьовує else
//
let x = typeof (1);
switch (x) {
    case 'number':
        document.write(`1 . Тип данних Number</br>`);
        break;
    case 'string':
        document.write(`2 . Тип данних String</br>`);
        break;
    case 'boolean':
        document.write(`3 . Тип данних Boolean</br>`);
        break;
    case 'object':
        document.write(`4 . Тип данних Object</br>`);
        break;
    default:
        document.write(`в змінну записали щось інше</br>`);
        break;
}

//
// - Задача-гра "чи ми йдемо сьогодні в OKTEN на навчання?".
//     Змінна, яка характеризує температуру. Якщо температура від +10 до +22 вивести повідомлення що ми йдемо ВЧИТИСЯ .
//     Якщо інша темпаретура, тоді виводимо повідомлення що сидимо вдома і вчимося ОНЛАЙН
//

let temp = 22;
(temp > 19 && temp < 23) ? document.write(`ми йдемо ВЧИТИСЯ</br>`) : document.write(`сидимо вдома і вчимося ОНЛАЙН</br>`);


//
// - За допомогою switch case - реалізувати гру - вікторину, де ми вводимо число від 1 до 5. І взалежності від введеного
//     числа нам дається приз. (Авто, Мото, Телефон, і т.д ) і якщо число не підходить тоді  вивести Повідомлення - що число не вірне ... .
let YourFavoriteNumber = 9
switch (YourFavoriteNumber) {
    case 1:
        document.write(`Ти виграв Клізму</br>`);
        break;
    case 2:
        document.write(`Ти виграв Чайник</br>`);
        break;
    case 3:
        document.write(`Ти виграв Телевізор</br>`);
        break;
    case 4:
        document.write(`Ти виграв Путівку</br>`);
        break;
    case 5:
        document.write(`Ти виграв Квартиру</br>`);
        break;
    default:
        document.write(`Ти взагалі читати вмієш?</br>`);
        break;
}