// Всі функції повинні бути описані стрілочним типом, та selfinvoke!!!!
//     - створити функцію яка приймає три числа та виводить найменьше. (Без Math.min!)
let minNubner = (a, b, c) => {
    // let minNum = a > b ? b < c ? b : c : a < c ? a : c;
    let minNum = (b < a) ? b : a
    console.log((c < minNum) ? c : minNum)
}
minNubner(9, 8, 33);

(function (a,b,c) {
    console.log(a > b ? b < c ? b : c : a < c ? a : c);
}(1, 8, 2));

// - створити функцію яка приймає три числа та виводить найбільше. (Без Math.max!)



// - створити функцію яка повертає найбільше число з масиву
// - створити функцію яка повертає найменьше число з масиву
// - створити функцію яка приймає масив чисел, сумує значення елементів масиву та повертає його. Приклад [1,2,10]->13
// - створити функцію яка приймає масив чисел та повертає середнє арифметичне його значень.
// - створити функцію яка приймає будь-яку кількість чисел, повертає найменьше, а виводить найбільше (Math використовувати заборонено);
// - створити функцію яка заповнює масив рандомними числами
// (цей код генерує рандомні числа в діапазоні від 0 до 100 - Math.round(Math.random()*100)) та виводить його.
// - створити функцію яка заповнює масив рандомними числами в діапазоні від 0 до limit. limit - аргумент, який характеризує кінцеве значення діапазону.
// - Функція приймає масив та робить з нього новий масив в зворотньому порядку. [1,2,3] -> [3, 2, 1].