// Всі функції повинні бути описані стрілочним типом, та selfinvoke!!!!
//     - створити функцію яка обчислює та повертає площу прямокутника висотою

// стрілочним типом
let areaRectangle = (a, b) => a * b;
console.log(areaRectangle(14, 5));

// Self-Invoking Functions
(function (a, b) {
    console.log(a * b)
}(5, 8));


// - створити функцію яка обчислює та повертає площу кола
// стрілочним типом
let areaCircle = (radius) => Math.PI*Math.pow(radius,2);
console.log(areaCircle(6));

// Self-Invoking Functions
(function (radius) {
    console.log(Math.PI*Math.pow(radius,2))
}(6));

// - створити функцію яка обчислює та повертає площу циліндру 2ПRH
let  cilinderArea = (radius, height) => 2*Math.PI*radius*height;
console.log(cilinderArea(5,9));

// ctrl+ alt +w


// - створити функцію яка приймає масив та виводить кожен його елемент

// - створити функцію яка  створює параграф з текстом. Текст задати через аргумент
// - створити функцію яка  створює ul з трьома елементами li. Текст li задати через аргумент всім однаковий
// - створити функцію яка  створює ul з трьома елементами li. Текст li задати через аргумент всім однаковий. Кількість li визначається другим аргументом, який є числовим (тут використовувати цикл)
// - створити функцію яка приймає масив примітивних елементів (числа,стрінги,булеві), та будує для них список
//
// - створити функцію яка приймає масив об'єктів з наступними полями id,name,age , та виводить їх в документ. Для кожного об'єкту окремий блок.
